In [2]:
pip install geopy

Collecting geopy
  Downloading geopy-2.3.0-py3-none-any.whl (119 kB)
     |████████████████████████████████| 119 kB 3.0 MB/s eta 0:00:01
Collecting geographiclib<3,>=1.52
  Downloading geographiclib-2.0-py3-none-any.whl (40 kB)
     |████████████████████████████████| 40 kB 6.0 MB/s eta 0:00:011
Installing collected packages: geographiclib, geopy
Successfully installed geographiclib-2.0 geopy-2.3.0
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install Nominatim

Collecting Nominatim
  Downloading nominatim-0.1.tar.gz (1.7 kB)
Building wheels for collected packages: Nominatim
  Building wheel for Nominatim (setup.py) ... done
  Created wheel for Nominatim: filename=nominatim-0.1-py3-none-any.whl size=2363 sha256=9e887a11ae37e92ff9de926183cf1240199cfe18437fcf442cd932412f4a863e
  Stored in directory: /Users/ajdomingo/Library/Caches/pip/wheels/37/00/9e/d904c390bfb174830ad3dcfd62af5544cee7d88bed4f8acedd
Successfully built Nominatim
Installing collected packages: Nominatim
Successfully installed Nominatim-0.1
Note: you may need to restart the kernel to use updated packages.

In [2]:
from geopy.geocoders import Nominatim
import pandas as pd

In [4]:
summary = "Data/summary.csv"
summary = pd.read_csv(summary)
summary.head()

,Unnamed: 0,Date,City,State,Country,Shape,Duration,Summary,Posted,Images,ReportNum
0,0,7/31/22 22:52,Cuenca,NaN,USA,Light,5 minutes,Triangle shape moving lights,10/8/22,Yes,0
1,1,7/31/22 21:59,West Lafayette,OH,USA,Light,4 minutes,Bright circle light moving through sky.,9/9/22,Yes,1
2,2,7/31/22 21:45,Burr Ridge,IL,USA,Other,NaN,"Strange red, blue and black craft in the sky a...",9/9/22,Yes,2
3,3,7/31/22 21:25,"Lingan, Cape Breton Island",NS,USA,Cylinder,1-2 minutes,We were waiting for fireworks to start across ...,9/9/22,NaN,3
4,4,7/31/22 21:15,Conway,SC,USA,Circle,Less than a minute,Round bright white light go in a straight line...,9/9/22,NaN,4

In [5]:
summary.rename({"Unnamed: 0":"a"}, axis="columns", inplace=True)
summary.drop(["a"], axis=1, inplace=True)

In [6]:
city_df = summary[['City', 'State', 'ReportNum']]

In [7]:
city_df.fillna("")

                            City State  ReportNum
0                         Cuenca                0
1                 West Lafayette    OH          1
2                     Burr Ridge    IL          2
3     Lingan, Cape Breton Island    NS          3
4                         Conway    SC          4
...                          ...   ...        ...
2462                   Snowflake    AZ        153
2463                                          154
2464                     El paso    TX        155
2465                 CHARLESTOWN    IN        156
2466                   Mansfield    TX        157

[2467 rows x 3 columns]

In [8]:
city_df["city/state"] = city_df[['City', 'State']].apply(lambda x: ', '.join(x[x.notnull()]), axis=1)

/Users/ajdomingo/opt/anaconda3/envs/pythondata/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [9]:
city_df.head()

                         City State  ReportNum                      city/state
0                      Cuenca   NaN          0                          Cuenca
1              West Lafayette    OH          1              West Lafayette, OH
2                  Burr Ridge    IL          2                  Burr Ridge, IL
3  Lingan, Cape Breton Island    NS          3  Lingan, Cape Breton Island, NS
4                      Conway    SC          4                      Conway, SC

In [10]:
uniques = city_df['city/state'].unique()
unique_df = pd.DataFrame(uniques)
unique_df

                                   0
0                             Cuenca
1                 West Lafayette, OH
2                     Burr Ridge, IL
3     Lingan, Cape Breton Island, NS
4                         Conway, SC
...                              ...
1955                   Blakeslee, OH
1956                   Snowflake, AZ
1957                     El paso, TX
1958                 CHARLESTOWN, IN
1959                   Mansfield, TX

[1960 rows x 1 columns]

In [11]:
unique_df[['City', 'State']] = unique_df[0].str.split(', ', 1, expand=True)

In [12]:
unique_df.head()

                                0            City                   State
0                          Cuenca          Cuenca                    None
1              West Lafayette, OH  West Lafayette                      OH
2                  Burr Ridge, IL      Burr Ridge                      IL
3  Lingan, Cape Breton Island, NS          Lingan  Cape Breton Island, NS
4                      Conway, SC          Conway                      SC